package com.example.tgbot.enums;

public enum ReplyMessage {
    MAIN_MENU("Главное меню"),
    LIFE_HACKS("У нас есть для вас 6 лайфхаков по учебе. Выберите номер❓"),
    LIFE_HACKS_1("Если вы хотите узнать подробную информацию о преподавателе, то вы можете найти ее по хештегам в телеграм канале https://t.me/spbguap_chat\uD83D\uDCA1"),
    LIFE_HACKS_2("Важно уметь правильно распределять свое время и ставить четкие цели. Отличный вариант - завести планер. Ведение планера помогает структурировать мысли и выставлять приоритеты.\uD83D\uDCA1"),
    LIFE_HACKS_3("Обращайте внимание на дедлайны в личном кабинете: красная дата означает, что работу нужно загрузить точно в срок, а дата другого цвета означает, что загрузить возможно и после дедлайна.\uD83D\uDCA1"),
    LIFE_HACKS_4("Найдите человека (можно со старших курсов) с таким же номером варианта как у вас: так вы сможете помогать друг другу в процессе выполнения лабораторных работ.\uD83D\uDCA1"),
    LIFE_HACKS_5("Внимательно изучите ГОСТы и введите себе привычку оформлять отчеты по ГОСТам, это убережет вас от потери баллов на лабораторных.\uD83D\uDCA1"),
    LIFE_HACKS_6("Учтите, что в тестах LMS есть ограничение на время между прохождениями всех попыток текста: начинайте заранее, потому что в последний день подготовки вы просто не успеете использовать все ваши 5 попыток.\uD83D\uDCA1"),
    PLACES("Какие места тебя интересуют❓"),
    PLACES_COST("Отлично, какой у тебя бюджет❓"),
    FOOD_300("NUDEL\uD83C\uDF5C \n\n" +
            "Здесь ты сможешь отведать восхитительной лапши и окунуться в атмосферу Китая \n" +
            "А приложение СКС ДИСКОНТ поможет сэкономить тебе до 20% \uD83E\uDD11 \n\n" +
            "Адрес: Лиговский проспект, 71 лит А \n " +
            "-------------------------------------------\n" +
            "ТВОЯ ШАВЕРМА\uD83C\uDF2F \n\n" +
            "Восхитительная шаверма по приятной цене \n\n" +
            "Адрес: Московский проспект, 130а\n" +
            "-------------------------------------------\n" +
            "Столовая №1\uD83E\uDD5F \n\n" +
            "Домашняя кухня, сочетающая в себе качество и приятную цену\n\n" +
            "Адрес: Сенная площадь, 6\n"),
    FOOD_500("КОФЕЙНЯ №1☕️ \n\n" +
            "В меню ты сможешь найти все, что угодно и на любой вкус \n" +
            "ВЫГОДНО: завтраки & ланчи, а до 18.00 роллы 1 + 1\n\n" +
            "Адрес: Московский проспект, 167\n " +
            "-------------------------------------------\n" +
            "ТОКИО-CITY\uD83C\uDF63 \n\n" +
            "Огромный выбор еды на любой вкус \n\n" +
            "Адрес: Адрес: Сенная площадь, 7\n" +
            "-------------------------------------------\n" +
            "БАСКИН РОББИНС\uD83C\uDF68 \n\n" +
            "Здесь ты поймешь, что это лучшее мороженое в твоей жизни... Доверься мне\n\n" +
            "Адрес: Набережная канала Грибоедова, 19\n"),
    FOOD_1000("ХАЧАПУРИ И ВИНО\uD83C\uDF77 \n\n" +
            "Потрясающая грузинская кухня! Не забудь заранее заказать столик \n" +
            "Адрес: Казанская, 29\n " +
            "-------------------------------------------\n" +
            "LUCKY PIZZA\uD83C\uDF55 \n\n" +
            "Вкусная пицца и вкусная скидка до 30% с СКС ДИСКОНТ\n\n" +
            "Адрес: 2-я Красноармейская, д. 3\n" +
            "-------------------------------------------\n" +
            "CHLOE CAFE\uD83C\uDF70 \n\n" +
            "Настоящий рай для девочек! Отсюда ты уйдешь с кучей фотографий и восторгом от местных десертов :)\n\n" +
            "Адрес: Адрес: Малый проспект В.О., 9\n"),
    ENTERTAINMENTS_500("Я думаю, что сходить в кино это всегда отличная идея!\uD83C\uDF7F \n\n" +
            "Кинотеатр Синема Парк Радуга как раз находится на Парке Победы. И это отличная новость. \n\n" +
            "Адрес: Проспект Космонавтов, 14\n "),
    ENTERTAINMENTS_1000("Боулинг “На Сенной”\uD83C\uDFB3\n\n" +
            "Если ты любишь игры и у тебя есть небольшая компания, то поход в боулинг будет отличной идеей! А стоимость тебя несомненно порадует :)\n" +
            "Стоимость (пт-чт) - 480 рублей/час\n\n" +
            "Адрес: ул. Ефимова, 3\n" +
            "-------------------------------------------\n" +
            "Национальный шоу-музей “Гранд Макет Россия”\uD83C\uDDF7\uD83C\uDDFA\n\n" +
            "Это удивительный и самый большой макет России в мире! Такого ты точно нигде не видел(а).\n" +
            "Стоимость: 690 рублей\n\n" +
            "Адрес: Цветочная, 16 (м. Московские ворота)\n" +
            "-------------------------------------------\n" +
            "Парк активного отдыха и спортивного досуга “Горилла-Парк”\uD83E\uDD8D\n\n" +
            "Скидка 20% студентам!\n " +
            "Стоимость: Полный билет на весь день - 1080 рублей (с учетом скидки)\n\n" +
            "Адрес: ул. Долгоозерная, 14, ТРК “Пять озер"),
    //SPORT("Этот раздел находиться в разработке, в скором времени в нем будут самые интересные внутривузовские и городские спортивные мероприятия ☺️"),
    ANOTHER_ACTIVITIES("Выбери раздел который тебя интересует️❓"),
    DOCUMENTS("Выберите подходящий пункт❓"),
    DOC_MAT_HELP("ЧТО ДЕЛАТЬ\n" +
            "-прийти в офис Профкома ГУАП (БМ ауд.51-02а)\n" +
            "-взять бланк заявления на мат.помощь у секретаря и заполнять строго по образцу(Нужен ИНН и СНИЛС)\n" +
            "-распечатать копии первой страницы паспорта, страницу с пропиской и дополнительные документы при наличии\n" +
            "\n" +
            "КУДА НЕСТИ\n" +
            "1. Поставить подпись у декана/замдекана факультета или директора института. Первый и второй курсы подписывают в деканате своего института/факультета по младшим курсам.\n" +
            "2. Затем в отдел социальной и воспитательной работы, ауд. 11-10а на БМ\n\n" +
            "ДОПОЛНИТЕЛЬНЫЕ ДОКУМЕНТЫ ПРИ НАЛИЧИИ:\n" +
            "— справка об инвалидности своей или родителей (у родителей только 1 и 2 группы), \n" +
            "— справка о получении пенсии по потере кормильца, \n" +
            "— справка о статусе Чернобыльца, \n" +
            "— справка о смерти родителя (только, если смерть произошла непосредственно в текущее время) и др., \n" +
            "Подробно можно ознакомиться на сайте ГУАП в Положении о стипендиальном обеспечении, в разделе Материальная помощь обучающимся (позже ссылку добавлю)\n" +
            "\n" +
            "‼️Иностранцы материальную помощь оформляют через департамент международной деятельности (ДМД) на БМ."),
    DOC_GSS("ЧТО ДЕЛАТЬ\n" +
            "-прийти в офис Профкома ГУАП (БМ ауд.51-02а)\n" +
            "-взять бланк заявления на ГСС у секретаря и заполнять строго по образцу\n" +
            "-зарегистрировать справку о назначении государственной социальной помощи у секретаря офиса\n" +
            "-распечатать копии первой страницы паспорта, страницу с пропиской и необходимые документы\n" +
            "- взять все нужные подписи и принести в деканат\n" +
            "\n" +
            "КУДА НЕСТИ\n" +
            "1. Председателю ПК студентов Канашевой Анне Александровне (БМ ауд.11-04)\n" +
            "2. Председателю профбюро института/факультета либо профоргу группы\n" +
            "3. В деканат для подписи деканата факультета/директора института и регистрации справки\n\n" +
            "НЕОБХОДИМЫ ДОКУМЕНТЫ:" +
            "— копия справки о получении государственной социальной помощи\n" +
            "— удостоверение или справка студента-инвалида\n" +
            "— студента-чернобыльца\n" +
            "— студента-участника военных действий\n" +
            "— подтверждающие документы студента-сироты\n"),
    STUDIOS("ГУАП танцы \uD83D\uDC83\uD83C\uDFFB\n" +
            "https://vk.com/suaidance\n" +
            "\n" +
            "Волонтёрский отряд эволюция ГУАП \uD83C\uDFB8" +
            "https://vk.com/suai_evo\n" +
            "\n" +
            "гуап шоу\uD83C\uDFA4 \n" +
            "https://vk.com/suai_show\n" +
            "\n" +
            "Медиацентр ГУАП \uD83C\uDFAC\n" +
            "https://vk.com/guapmedia\n" +
            "\n" +
            "КВН ГУАП \uD83E\uDD21\n" +
            "https://vk.com/guap_kvn\n" +
            "\n" +
            "ГУАП радио \uD83D\uDCFB\n" +
            "https://vk.com/guapradio\n" +
            "\n" +
            "Фотостудия ГУАП \uD83D\uDCF8\n" +
            "https://vk.com/guapphoto\n" +
            "\n" +
            "Видеостудия ГУАП \uD83D\uDCF8\n" +
            "https://vk.com/guap_video\n" +
            "\n" +
            "Театральная студия ГУАП \uD83C\uDFAD\n" +
            "https://vk.com/guap_teatr\n" +
            "\n" +
            "Крылья ГУАП \uD83C\uDFB8\n" +
            "https://vk.com/wings_suai\n\n" +
            "Муз ГУАП \uD83C\uDFB7\n" +
            "https://vk.com/muzguap"),
    PROF("Программа «СКС-дисконт» \uD83D\uDC9A\n" +
            "\n" +
            "Самая большая дисконтная система для студентов всей страны в формате приложения. Получай скидки от партнеров и пользуйся базой знаний. В программе уже более 80 вузов, которые пользуются предложениями от более 900 партнеров.\n" +
            "Программа реализуется через приложение «СКС РФ»\n\n" +
            "http://sksrf.ru/sks_rf" +
            "\n" +
            "-------------------------------------------\n" +
            "Проект «За стипуху съездить» \uD83E\uDDF3\uD83D\uDEEB\n" +
            "\n" +
            "Уникальное трэвел-шоу, где студенты путешествуют по городам России на свою стипендию. Она бывает разной. Роскошь городов, рестораны, отели, автопарки — этого нет в наших выпусках, ведь наши участники путешествуют на стипендию.\n\n" +
            "http://sksrf.ru/zaetoyalyublyurossiyu"),
    HELP("Привет ! Я твой помощник\n" +
            "Что тебя интересует\n" +
            "\n" +
            "\uD83D\uDCA1- Лайфхаки по учебе\n" +
            "\uD83E\uDD13- Выплаты студентам\n" +
            "\uD83E\uDD73- Места и пространства\n" +
            //"\uD83C\uDFC0- Спорт\n" +
            "\uD83C\uDFB2- Внеучебная деятельность");

    private String name;

    ReplyMessage(String name) {
        this.name = name;
    }

    public String getName() {
        return name;
    }
}
